function ShowDate(){
//农历每月的天数
var yearlist;
yearlist	= new Array(
	new Array(  8,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0, 29, 30,   7,   1 ),
	new Array(  0, 29, 30, 29, 29, 30, 29, 30, 29, 30, 30, 30, 29,   0,   8,   2 ),
	new Array(  0, 30, 29, 30, 29, 29, 30, 29, 30, 29, 30, 30, 30,   0,   9,   3 ),
	new Array(  5, 29, 30, 29, 30, 29, 29, 30, 29, 29, 30, 30, 29, 30, 10,   4 ),
	new Array(  0, 30, 30, 29, 30, 29, 29, 30, 29, 29, 30, 30, 29,   0,   1,   5 ),
	new Array(  0, 30, 30, 29, 30, 30, 29, 29, 30, 29, 30, 29, 30,   0,   2,   6 ),
	new Array(  4, 29, 30, 30, 29, 30, 29, 30, 29, 30, 29, 30, 29, 30,   3,   7 ),
	new Array(  0, 29, 30, 29, 30, 29, 30, 30, 29, 30, 29, 30, 29,   0,   4,   8 ),
	new Array(  0, 30, 29, 29, 30, 30, 29, 30, 29, 30, 30, 29, 30,   0,   5,   9 ),
	new Array(  2, 29, 30, 29, 29, 30, 29, 30, 29, 30, 30, 30, 29, 30,   6, 10 ),
	new Array(  0, 29, 30, 29, 29, 30, 29, 30, 29, 30, 30, 30, 29,   0,   7, 11 ),
	new Array(  6, 30, 29, 30, 29, 29, 30, 29, 29, 30, 30, 29, 30, 30,   8, 12 ),
	new Array(  0, 30, 29, 30, 29, 29, 30, 29, 29, 30, 30, 29, 30,   0,   9,   1 ),
	new Array(  0, 30, 30, 29, 30, 29, 29, 30, 29, 29, 30, 29, 30,   0, 10,   2 ),
	new Array(  5, 30, 30, 29, 30, 29, 30, 29, 30, 29, 30, 29, 29, 30,   1,   3 ),
	new Array(  0, 30, 29, 30, 30, 29, 30, 29, 30, 29, 30, 29, 30,   0,   2,   4 ),
	new Array(  0, 29, 30, 29, 30, 29, 30, 30, 29, 30, 29, 30, 29,   0,   3,   5 ),
	new Array(  2, 30, 29, 29, 30, 29, 30, 30, 29, 30, 30, 29, 30, 29,   4,   6 ),
	new Array(  0, 30, 29, 29, 30, 29, 30, 29, 30, 30, 29, 30, 30,   0,   5,   7 ),
	new Array(  7, 29, 30, 29, 29, 30, 29, 29, 30, 30, 29, 30, 30, 30,   6,   8 ),
	new Array(  0, 29, 30, 29, 29, 30, 29, 29, 30, 30, 29, 30, 30,   0,   7,   9 ),
	new Array(  0, 30, 29, 30, 29, 29, 30, 29, 29, 30, 29, 30, 30,   0,   8, 10 ),
	new Array(  5, 30, 29, 30, 30, 29, 29, 30, 29, 29, 30, 29, 30, 30,   9, 11 ),
	new Array(  0, 29, 30, 30, 29, 30, 29, 30, 29, 29, 30, 29, 30,   0, 10, 12 ),
	new Array(  0, 29, 30, 30, 29, 30, 30, 29, 30, 29, 30, 29, 29,   0,   1,   1 ),
	new Array(  4, 30, 29, 30, 29, 30, 30, 29, 30, 30, 29, 30, 29, 30,   2,   2 ),
	new Array(  0, 29, 29, 30, 29, 30, 29, 30, 30, 29, 30, 30, 29,   0,   3,   3 ),
	new Array(  0, 30, 29, 29, 30, 29, 30, 29, 30, 29, 30, 30, 30,   0,   4,   4 ),
	new Array(  2, 29, 30, 29, 29, 30, 29, 29, 30, 29, 30, 30, 30, 30,   5,   5 ),
	new Array(  0, 29, 30, 29, 29, 30, 29, 29, 30, 29, 30, 30, 30,   0,   6,   6 ),
	new Array(  6, 29, 30, 30, 29, 29, 30, 29, 29, 30, 29, 30, 30, 29,   7,   7 ),
	new Array(  0, 30, 30, 29, 30, 29, 30, 29, 29, 30, 29, 30, 29,   0,   8,   8 ),
	new Array(  0, 30, 30, 30, 29, 30, 29, 30, 29, 29, 30, 29, 30,   0,   9,   9 ),
	new Array(  5, 29, 30, 30, 29, 30, 30, 29, 30, 29, 30, 29, 29, 30, 10, 10 ),
	new Array(  0, 29, 30, 29, 30, 30, 29, 30, 29, 30, 30, 29, 30,   0,   1, 11 ),
	new Array(  0, 29, 29, 30, 29, 30, 29, 30, 30, 29, 30, 30, 29,   0,   2, 12 ),
	new Array(  3, 30, 29, 29, 30, 29, 29, 30, 30, 29, 30, 30, 30, 29,   3,   1 ),
	new Array(  0, 30, 29, 29, 30, 29, 29, 30, 29, 30, 30, 30, 29,   0,   4,   2 ),
	new Array(  7, 30, 30, 29, 29, 30, 29, 29, 30, 29, 30, 30, 29, 30,   5,   3 ),
	new Array(  0, 30, 30, 29, 29, 30, 29, 29, 30, 29, 30, 29, 30,   0,   6,   4 ),
	new Array(  0, 30, 30, 29, 30, 29, 30, 29, 29, 30, 29, 30, 29,   0,   7,   5 ),
	new Array(  6, 30, 30, 29, 30, 30, 29, 30, 29, 29, 30, 29, 30, 29,   8,   6 ),
	new Array(  0, 30, 29, 30, 30, 29, 30, 29, 30, 29, 30, 29, 30,   0,   9,   7 ),
	new Array(  0, 29, 30, 29, 30, 29, 30, 30, 29, 30, 29, 30, 29,   0, 10,   8 ),
	new Array(  4, 30, 29, 30, 29, 30, 29, 30, 29, 30, 30, 29, 30, 30,   1,   9 ),
	new Array(  0, 29, 29, 30, 29, 29, 30, 29, 30, 30, 30, 29, 30,   0,   2, 10 ),
	new Array(  0, 30, 29, 29, 30, 29, 29, 30, 29, 30, 30, 29, 30,   0,   3, 11 ),
	new Array(  2, 30, 30, 29, 29, 30, 29, 29, 30, 29, 30, 29, 30, 30,   4, 12 ),
	new Array(  0, 30, 29, 30, 29, 30, 29, 29, 30, 29, 30, 29, 30,   0,   5,   1 ),
	new Array(  7, 30, 29, 30, 30, 29, 30, 29, 29, 30, 29, 30, 29, 30,   6,   2 ),
	new Array(  0, 29, 30, 30, 29, 30, 30, 29, 29, 30, 29, 30, 29,   0,   7,   3 ),
	new Array(  0, 30, 29, 30, 30, 29, 30, 29, 30, 29, 30, 29, 30,   0,   8,   4 ),
	new Array(  5, 29, 30, 29, 30, 29, 30, 29, 30, 30, 29, 30, 29, 30,   9,   5 ),
	new Array(  0, 29, 30, 29, 29, 30, 30, 29, 30, 30, 29, 30, 29,   0, 10,   6 ),
	new Array(  0, 30, 29, 30, 29, 29, 30, 29, 30, 30, 29, 30, 30,   0,   1,   7 ),
	new Array(  3, 29, 30, 29, 30, 29, 29, 30, 29, 30, 29, 30, 30, 30,   2,   8 ),
	new Array(  0, 29, 30, 29, 30, 29, 29, 30, 29, 30, 29, 30, 30,   0,   3,   9 ),
	new Array(  8, 30, 29, 30, 29, 30, 29, 29, 30, 29, 30, 29, 30, 29,   4, 10 ),
	new Array(  0, 30, 30, 30, 29, 30, 29, 29, 30, 29, 30, 29, 30,   0,   5, 11 ),
	new Array(  0, 29, 30, 30, 29, 30, 29, 30, 29, 30, 29, 30, 29,   0,   6, 12 ),
	new Array(  6, 30, 29, 30, 29, 30, 30, 29, 30, 29, 30, 29, 30, 29,   7,   1 ),
	new Array(  0, 30, 29, 30, 29, 30, 29, 30, 30, 29, 30, 29, 30,   0,   8,   2 ),
	new Array(  0, 29, 30, 29, 29, 30, 29, 30, 30, 29, 30, 30, 29,   0,   9,   3 ),
	new Array(  4, 30, 29, 30, 29, 29, 30, 29, 30, 29, 30, 30, 30, 29, 10,   4 ),
	new Array(  0, 30, 29, 30, 29, 29, 30, 29, 30, 29, 30, 30, 30,   0,   1,   5 ),
	new Array(  0, 29, 30, 29, 30, 29, 29, 30, 29, 29, 30, 30, 29,   0,   2,   6 ),
	new Array(  3, 30, 30, 30, 29, 30, 29, 29, 30, 29, 29, 30, 30, 29,   3,   7 ),
	new Array(  0, 30, 30, 29, 30, 30, 29, 29, 30, 29, 30, 29, 30,   0,   4,   8 ),
	new Array(  7, 29, 30, 29, 30, 30, 29, 30, 29, 30, 29, 30, 29, 30,   5,   9 ),
	new Array(  0, 29, 30, 29, 30, 29, 30, 30, 29, 30, 29, 30, 29,   0,   6, 10 ),
	new Array(  0, 30, 29, 29, 30, 29, 30, 30, 29, 30, 30, 29, 30,   0,   7, 11 ),
	new Array(  5, 29, 30, 29, 29, 30, 29, 30, 29, 30, 30, 30, 29, 30,   8, 12 ),
	new Array(  0, 29, 30, 29, 29, 30, 29, 30, 29, 30, 30, 29, 30,   0,   9,   1 ),
	new Array(  0, 30, 29, 30, 29, 29, 30, 29, 29, 30, 30, 29, 30,   0, 10,   2 ),
	new Array(  4, 30, 30, 29, 30, 29, 29, 30, 29, 29, 30, 30, 29, 30,   1,   3 ),
	new Array(  0, 30, 30, 29, 30, 29, 29, 30, 29, 29, 30, 29, 30,   0,   2,   4 ),
	new Array(  8, 30, 30, 29, 30, 29, 30, 29, 30, 29, 29, 30, 29, 30,   3,   5 ),
	new Array(  0, 30, 29, 30, 30, 29, 30, 29, 30, 29, 30, 29, 29,   0,   4,   6 ),
	new Array(  0, 30, 29, 30, 30, 29, 30, 30, 29, 30, 29, 30, 29,   0,   5,   7 ),
	new Array(  6, 30, 29, 29, 30, 29, 30, 30, 29, 30, 30, 29, 30, 29,   6,   8 ),
	new Array(  0, 30, 29, 29, 30, 29, 30, 29, 30, 30, 29, 30, 30,   0,   7,   9 ),
	new Array(  0, 29, 30, 29, 29, 30, 29, 29, 30, 30, 29, 30, 30,   0,   8, 10 ),
	new Array(  4, 30, 29, 30, 29, 29, 30, 29, 29, 30, 29, 30, 30, 30,   9, 11 ),
	new Array(  0, 30, 29, 30, 29, 29, 30, 29, 29, 30, 29, 30, 30,   0, 10, 12 ),
	new Array(10, 30, 29, 30, 30, 29, 29, 30, 29, 29, 30, 29, 30, 30,   1,   1 ),
	new Array(  0, 29, 30, 30, 29, 30, 29, 30, 29, 29, 30, 29, 30,   0,   2,   2 ),
	new Array(  0, 29, 30, 30, 29, 30, 30, 29, 30, 29, 30, 29, 29,   0,   3,   3 ),
	new Array(  6, 30, 29, 30, 29, 30, 30, 29, 30, 30, 29, 30, 29, 29,   4,   4 ),
	new Array(  0, 30, 29, 30, 29, 30, 29, 30, 30, 29, 30, 30, 29,   0,   5,   5 ),
	new Array(  0, 30, 29, 29, 30, 29, 29, 30, 30, 29, 30, 30, 30,   0,   6,   6 ),
	new Array(  5, 29, 30, 29, 29, 30, 29, 29, 30, 29, 30, 30, 30, 30,   7,   7 ),
	new Array(  0, 29, 30, 29, 29, 30, 29, 29, 30, 29, 30, 30, 30,   0,   8,   8 ),
	new Array(  0, 29, 30, 30, 29, 29, 30, 29, 29, 30, 29, 30, 30,   0,   9,   9 ),
	new Array(  3, 29, 30, 30, 29, 30, 29, 30, 29, 29, 30, 29, 30, 29, 10, 10 ),
	new Array(  0, 30, 30, 30, 29, 30, 29, 30, 29, 29, 30, 29, 30,   0,   1, 11 ),
	new Array(  8, 29, 30, 30, 29, 30, 29, 30, 30, 29, 29, 30, 29, 30,   2, 12 ),
	new Array(  0, 29, 30, 29, 30, 30, 29, 30, 29, 30, 30, 29, 29,   0,   3,   1 ),
	new Array(  0, 30, 29, 30, 29, 30, 29, 30, 30, 29, 30, 30, 29,   0,   4,   2 ),
	new Array(  5, 30, 29, 29, 30, 29, 29, 30, 30, 29, 30, 30, 29, 30,   5,   3 ),
	new Array(  0, 30, 29, 29, 30, 29, 29, 30, 29, 30, 30, 30, 29,   0,   6,   4 ),
	new Array(  0, 30, 30, 29, 29, 30, 29, 29, 30, 29, 30, 30, 29,   0,   7,   5 ),
	new Array(  4, 30, 30, 29, 30, 29, 30, 29, 29, 30, 29, 30, 29, 30,   8,   6 ),
	new Array(  0, 30, 30, 29, 30, 29, 30, 29, 29, 30, 29, 30, 29,   0,   9,   7 ),
	new Array(  0, 30, 30, 29, 30, 30, 29, 30, 29, 29, 30, 29, 30,   0, 10,   8 ),
	new Array(  2, 29, 30, 29, 30, 30, 29, 30, 29, 30, 29, 30, 29, 30,   1,   9 ),
	new Array(  0, 29, 30, 29, 30, 29, 30, 30, 29, 30, 29, 30, 29,   0,   2, 10 ),
	new Array(  7, 30, 29, 30, 29, 30, 29, 30, 29, 30, 30, 29, 30, 30,   3, 11 ),
	new Array(  0, 29, 29, 30, 29, 29, 30, 29, 30, 30, 30, 29, 30,   0,   4, 12 ),
	new Array(  0, 30, 29, 29, 30, 29, 29, 30, 29, 30, 30, 29, 30,   0,   5,   1 ),
	new Array(  5, 30, 30, 29, 29, 30, 29, 29, 30, 29, 30, 29, 30, 30,   6,   2 ),
	new Array(  0, 30, 29, 30, 29, 30, 29, 29, 30, 29, 30, 29, 30,   0,   7,   3 ),
	new Array(  0, 30, 29, 30, 30, 29, 30, 29, 29, 30, 29, 30, 29,   0,   8,   4 ),
	new Array(  4, 30, 29, 30, 30, 29, 30, 29, 30, 29, 30, 29, 30, 29,   9,   5 ),
	new Array(  0, 30, 29, 30, 29, 30, 30, 29, 30, 29, 30, 29, 30,   0, 10,   6 ),
	new Array(  9, 29, 30, 29, 30, 29, 30, 29, 30, 30, 29, 30, 29, 30,   1,   7 ),
	new Array(  0, 29, 30, 29, 29, 30, 29, 30, 30, 30, 29, 30, 29,   0,   2,   8 ),
	new Array(  0, 30, 29, 30, 29, 29, 30, 29, 30, 30, 29, 30, 30,   0,   3,   9 ),
	new Array(  6, 29, 30, 29, 30, 29, 29, 30, 29, 30, 29, 30, 30, 30,   4, 10 ),
	new Array(  0, 29, 30, 29, 30, 29, 29, 30, 29, 30, 29, 30, 30,   0,   5, 11 ),
	new Array(  0, 30, 29, 30, 29, 30, 29, 29, 30, 29, 29, 30, 30,   0,   6, 12 ),
	new Array(  4, 29, 30, 30, 30, 29, 30, 29, 29, 30, 29, 30, 29, 30,   7,   1 )
);

var strcn10;
var strcn12;
var strconmonth;
var strcnday;

strcn10		= new Array( "null", "甲", "乙", "丙", "丁", "戊", "己", "庚", "辛", "壬", "癸" );				//农历天干
strcn12		= new Array( "null", "子", "丑", "寅", "卯", "辰", "巳", "午", "未", "申", "酉", "戌", "亥" );			//农历地支
strcnmonth	= new Array( "闰", "正", "二", "三", "四", "五", "六", "七", "八", "九", "十", "十一", "十二", "月" );		//农历月份
strcnday		= new Array( "null", "初一", "初二", "初三", "初四", "初五", "初六", "初七", "初八", "初九", "初十", "十一", "十二", "十三", "十四", "十五", "十六", "十七", "十八", "十九", "二十", "廿一", "廿二", "廿三", "廿四", "廿五", "廿六", "廿七", "廿八", "廿九", "三十" );

//赋给初值
//天干地支
var ten;
var twelve;
var weekday;
var thecnday;
var thecnmonth;
var cntotaldays;
var total;
var today;

ten		= 0;
twelve		= 0;
weekday		= 5;		//星期 1900年12月21日是星期五
thecnday		= 0;		//农历日
thecnmonth	= 0;		//农历月
cntotaldays	= 0;		//阴历总天数
total		= 11;		//阳历总天数 1900年12月21日到1901年1月1日共11天
today		= new Date();	//获得当日日期

var today = new Date();
var year = today.getFullYear();
var month = today.getMonth() + 1;

//计算到所求日期阳历的总天数,自1900年12月21日始

for ( y = 1901; y < year; y++ ) {//先算年的和
	total 	+= 365;
	if ( y % 4 == 0 ) total++;
}
//再加当年的几个月
switch ( month ){
	case 12:
		total	+= 30;
	case 11:
		total	+= 31;
	case 10:
		total	+= 30;
	case 9:
		total	+= 31;
	case 8:
		total	+= 31;
	case 7:
		total	+= 30;
	case 6:
		total	+= 31;
	case 5:
		total	+= 30;
	case 4:
		total	+= 31;
	case 3:
		total	+= 28;
	case 2:
		total	+= 31;
}

if ( year % 4 == 0 && month > 2 ) total++;		//如果当年是闰年还要加一天


weekday	= ( total + weekday ) % 7;			//计算当月一日是星期几

//用农历的天数累加来判断是否超过阳历的天数
over	= 0;//判断跳出循环的条件
row	= 0;
while ( row <= 120 ){
	col = 1;
	while ( col <= 13 ){
		cntotaldays += yearlist[row][col];
		if ( cntotaldays >= total ){
			over = 1;
			break;
		}
	col++;
	}
	if ( over == 1 ) break;
	row++;
}

//计算所求月份1号的农历日期
thecnday	= yearlist[row][col] - ( cntotaldays - total );

//echo thecnday;
//月头空开的天数
nulldayofmonth	= weekday;
//是否跨越一年
switch ( month ){
	case 1:
	case 3:
	case 5:
	case 7:
	case 8:
	case 10:
	case 12:
		curmonthdays = 31;
		break;
	case 4:
	case 6:
	case 9:
	case 11:
		curmonthdays = 30;
		break;
	case 2:
		if ( year % 4 == 0 ){
			curmonthdays = 29;
		} else {
			curmonthdays = 28;
		}
		break;
}

curday = 1;
while ( curday <= curmonthdays ){			// curmonthdays：本月的天数
	for ( s = 0; s <= 6; s++ ){
		if ( nulldayofmonth != 0 || curday > curmonthdays ) {
			nulldayofmonth--;
		} else {
			//生成中文农历
			if ( thecnday == 1 ) { //阴历每月第一日，打印阴历月份（正月、二月、三月……）
				
				if ( yearlist[row][0] != 0 && yearlist[row][0] < col ) {
					thecnmonth = col - 1;
				} else {
					thecnmonth = col;
				}
				
				if ( yearlist[row][0] != 0 && yearlist[row][0] + 1 == col ) {
					chi = strcnmonth[0]+strcnmonth[thecnmonth]+strcnmonth[13];	//闰月
				} else {
					chi = strcnmonth[thecnmonth]+strcnmonth[13];
				}
				
			} else {
				chi = strcnday[thecnday];
			}
			
			if ( curday == 1 && thecnday != 1 ) {
				
				if ( yearlist[row][0] != 0 && yearlist[row][0] < col ){
					thecnmonth = col - 1;
				} else {
					thecnmonth = col;
				}
				
				if ( yearlist[row][0] != 0 && yearlist[row][0] + 1 == col ) {
					init_mon = strcnmonth[0]+strcnmonth[thecnmonth]+strcnmonth[13];	//闰月
				} else {
					init_mon = strcnmonth[thecnmonth]+strcnmonth[13];
				}
				
			}
			
			if ( thecnday == 1 ) {
				init_mon	= chi;
			}
			
			tail_day = chi;
			
			if ( chi == init_mon ) tail_day = '初一';
			
			if ( curday == today.getDate() ) {
			strRet  = strcn10[yearlist[row][14]]+strcn12[yearlist[row][15]]+"年 ";
			strRet += init_mon+tail_day;
			}
			
			//下一天
			curday++;
			thecnday++;
			if ( thecnday > yearlist[row][col] ){
				thecnday = 1;
				col++;
			}
			if ( ( col > 12 && yearlist[row][0] == 0 ) || ( col > 13 && yearlist[row][0] != 0 ) ) {
				col = 1;
				row++;
			}
		}// end else
	}// end for
}

var cnweekstr =  new Array( "", "星期一", "星期二", "星期三", "星期四", "星期五", "星期六", "星期日" );
document.write( year + "年" + month + "月" + today.getDate() + "日" + " " );
document.write( cnweekstr[today.getDay()] + " " );
document.write( "农历" + strRet );

}